#
# Напишите программу, которая выводит на экран:
#
# - Did Joffrey agree?
# - He did. He also said "I love using \n".
# Ваша программа должна использовать только один print(), но выводить результат на экране в две строчки, как показано выше.

print('- Did Joffrey agree?\n- He did. He also said "I love using \\n".')